# Created 2019-07-05 Fri 11:27
#+TITLE: Protobuf Reading and Writting in R
#+AUTHOR: Fred K. Gruber
#+property: header-args :tangle yes :eval never-export
#+property: header-args:R :session *R* :exports both
-----

** Load Protobuf Definition
In R we first need to load the ~.proto~ file using the
~readProtoFiles~ function.
#+begin_src R
library("RProtoBuf")
source("./Code/varint.R")
readProtoFiles("./Code/example.proto")
#+end_src

Then we can create two messages that we would like to write to a binary file.
#+begin_src R
p1 = new(example.Person, id = 1, name = 'Dirk')
p1$email = "test@test.com"
p2 = new(example.Person, id = 2)
p2$name = "Mary"
print(p1)
print(p2)
#+end_src
#+results: 
: name: "Dirk"
: id: 1
: email: "test@test.com"
: name: "Mary"
: id: 2

** Write Protobuf To binary file
The function ~VarintBytes32~ given in the ~./Code/~ folder is used to
encode the message length using the varint format. The length is
written to the binary file with the funciton ~writeBin~ while the
actual message is written using the ~serialize~ function.

#+begin_src R
fname = "./Code/binproto.protobuf"
fileo = file(fname, open = "wb", raw = TRUE)
mysize = VarintBytes32(p1$bytesize())
writeBin(mysize, fileo)
p1$serialize(fileo)

mysize2 = VarintBytes32(p2$bytesize())
writeBin(mysize2, fileo)
p2$serialize(fileo)
close(fileo)
#+end_src

There should now be a file called ~binproto.protobuf~ on the Code
folder with the binary content.

#+begin_src R
system("ls -l ./Code")
#+end_src

#+results: 
: total 24
: -rw-r--r--  1 fred  staff   33 Apr  8 20:38 binproto.protobuf
: -rw-r--r--  1 fred  staff  409 Apr  8 20:29 example.proto
: -rw-r--r--  1 fred  staff  911 Apr  8 20:13 varint.R


#+begin_src R
system("cat ./Code/binproto.protobuf", intern=TRUE)
#+end_src

#+results: 
: [1] "\027"                                 
: [2] "\004Dirk\020\001\032\rtest@test.com\b"
: [3] "\004Mary\020\002"

** Read Protobuf file
In order to read the binary protobuf file it is necessary to first
read the binary file to memory. 
#+begin_src R
fileloc = "Code/binproto.protobuf"
alldata = readBin(fileloc, "raw", file.size(fileloc))
alldata
#+end_src

#+results: 
:  [1] 17 0a 04 44 69 72 6b 10 01 1a 0d 74 65 73 74 40 74 65 73 74 2e 63 6f 6d 08
: [26] 0a 04 4d 61 72 79 10 02


Then the function ~DecodeVarint32~ is used to decode the length of the
message as well as the start position. With this information it is
possible to parse the protobuf using the ~read~ function. This is
repeated for every message.
#+begin_src R
n = 1
pos = DecodeVarint32(alldata,n)
clen = pos[[1]]
n = pos[[2]]
nend = n + clen - 1
tmp = alldata[n:nend]
p1_read = example.Person$read(tmp)
n = clen + n
pos = DecodeVarint32(alldata,n)
clen = pos[[1]]
n = pos[[2]]
nend = n + clen - 1
tmp = alldata[n:nend]
p2_read = example.Person$read(tmp)

print(p1_read)
print(p2_read)
#+end_src

#+results: 
: 
: name: "Dirk"
: id: 1
: email: "test@test.com"
: 
: name: "Mary"
: id: 2


